#ifndef _MYCHECK_ELSE
#define _MYCHECK_ELSE

/***************************************************************
  *  @brief     将存储表格复制到工作表格 
  *  @param     argc, agrv  
  *  @note      无 
  *  @Sample usage:     将存储表格复制到工作表格 
 **************************************************************/
int refresh(int,char**);



/***************************************************************
  *  @brief     获取帮助 
  *  @param     argc, agrv   
  *  @note      无 
  *  @Sample usage:     获取帮助 
 **************************************************************/
int gethelp(int,char**);


/***************************************************************
  *  @brief     初始化表格 
  *  @param     argc,agrv   
  *  @note      无 
  *  @Sample usage:     新建.mycheck文件夹并置空表格与配置 
 **************************************************************/
int getinit(int,char**);

#endif
